Keule/ZAI_GPS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
/**
 * @file hal_impl.cpp
 * @brief ESP32-S3 HAL implementation for LilyGO T-ETH-Lite-S3.
 *
 * Hardware:
 *   - MCU: ESP32-S3-WROOM-1
 *   - Ethernet: W5500 over SPI3_HOST (GPIO 9/10/11/12/13/14) via ESP-IDF ETH driver
 *   - Sensor SPI (FSPI/SPI2_HOST): SCK=16, MISO=15, MOSI=17
 *     - ADS1118 ADC (steer angle): CS=18
 *     - BNO085 IMU: CS=47
 *     - Actuator: CS=40
 *   - SD Card (FSPI, OTA only): SCK=7, MISO=5, MOSI=6, CS=42
 *   - Safety: GPIO4 active LOW
 *
 * ADS1118 ADC uses the libdriver/ads1118 library (lib/ads1118/).
 * Interface functions (SPI transmit, init, deinit, delay, debug) are
 * implemented inline in this file to access the shared sensorSPI bus.
 *
 * W5500 Ethernet uses the ESP-IDF ETH driver:
 *   - Arduino ESP32 Core >= 3.0.0: native <ETH.h>
 *   - Arduino ESP32 Core <  3.0.0: LilyGO ETHClass2 library
 * NOT the Arduino Ethernet/Ethernet3 library.
 *
 * This file includes Arduino/ESP32 headers - it must NEVER be included
 * from PC simulation code.
 */

#include "hal_impl.h"
#include "hal/hal.h"
#include "hardware_pins.h"
#include "logic/pgn_types.h"
#include "logic/log_config.h"

#define LOG_LOCAL_LEVEL LOG_LEVEL_HAL
#include "esp_log.h"

// ===================================================================
// Arduino / ESP32 includes
// ===================================================================
#include <Arduino.h>
#include <SPI.h>           // SPIClass for sensor bus (FSPI)
#include <WiFi.h>
#include <WiFiUdp.h>
#include <Preferences.h>    // NVS flash storage for calibration
#include "driver_ads1118.h"  // libdriver ADS1118
#include <cstring>

// ===================================================================
// ETH driver selection based on Arduino ESP32 Core version
// ===================================================================
// Arduino ESP32 Core >= 3.0.0:  use native ETH (from <ETH.h>)
// Arduino ESP32 Core <  3.0.0:  use LilyGO ETHClass2 (lib/ETHClass2/)
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    #include <ETH.h>
    // Native ETH provides ETH global instance
#else
    #include "ETHClass2.h"
    // LilyGO ETHClass2 provides ETH2 global instance
    #define ETH ETH2
#endif

// ===================================================================
// W5500 Ethernet - ESP-IDF ETH driver (SPI3_HOST)
// ===================================================================

// UDP sockets for AgIO communication
// Reference uses separate sockets: one for receiving (port 8888),
// one for sending (from port 5126 to AgIO port 9999).
static WiFiUDP ethUDP_recv;  // Listen socket – bound to port 8888 (receives from AgIO)
static WiFiUDP ethUDP_send;  // Send socket – sends FROM port 5126 TO AgIO port 9999

// Static IP configuration
static IPAddress s_local_ip(192, 168, 1, 70);
static IPAddress s_subnet(255, 255, 255, 0);
static IPAddress s_gateway(192, 168, 1, 1);
static IPAddress s_dns(8, 8, 8, 8);
static IPAddress s_dest_ip(192, 168, 1, 255);

// Ethernet state tracking
static bool s_w5500_detected = false;   // true if ETH.begin() succeeded
static bool s_eth_link_up    = false;   // true if ARDUINO_EVENT_ETH_CONNECTED
static bool s_eth_has_ip     = false;   // true if ARDUINO_EVENT_ETH_GOT_IP

// ===================================================================
// Shared SPI bus - FSPI / SPI2_HOST
//
// CRITICAL: Must use FSPI, NOT HSPI!
// On ESP32-S3 (Arduino Core 2.x):  HSPI = SPI3_HOST (occupied by W5500!)
//                                  FSPI = SPI2_HOST (free for sensors)
//
// Sensor devices on this bus: ADS1118 (CS=18), IMU (CS=38), Actuator (CS=40).
// Pins: SCK=16, MISO=15, MOSI=17.
//
// SD card uses the SAME SPI peripheral (FSPI) but DIFFERENT pins (SCK=7, MISO=5, MOSI=6).
// During OTA updates, FSPI is re-initialised with SD pins via
// hal_sensor_spi_deinit() / hal_sensor_spi_reinit().
// ===================================================================
static SPIClass sensorSPI(FSPI);

// ===================================================================
// Shared sensor SPI transaction layer (bus lock + per-device settings)
// ===================================================================
enum class SpiClient : uint8_t {
    ADS1118 = 0,
    BNO085 = 1,
    ACTUATOR = 2,
};

struct SpiClientConfig {
    int cs_pin;
    uint32_t freq_hz;
    uint8_t mode;
    uint32_t period_us;   // polling interval target
};

static const SpiClientConfig k_spi_cfg_ads = {CS_STEER_ANG, 2000000, SPI_MODE1, 10000};  // 100 Hz
static SpiClientConfig k_spi_cfg_imu = {CS_IMU,       1000000, SPI_MODE3,  5000};  // 200 Hz
static const SpiClientConfig k_spi_cfg_act = {CS_ACT,       1000000, SPI_MODE0,     0};  // event-driven

static SemaphoreHandle_t s_spi_bus_mutex = nullptr;

struct SpiPollState {
    uint32_t next_due_us = 0;
    uint32_t deadline_miss = 0;
    uint32_t transactions = 0;
};

struct SpiBusTelemetry {
    uint32_t window_start_us = 0;
    uint32_t busy_us = 0;
    uint32_t transactions = 0;
};

static SpiPollState s_poll_imu;
static SpiPollState s_poll_was;
static SpiBusTelemetry s_bus_tm;

static int16_t s_was_raw_cache = 0;
static uint32_t s_was_last_poll_us = 0;
static bool s_was_cache_valid = false;

static const SpiClientConfig& spiCfg(SpiClient client) {
    switch (client) {
    case SpiClient::ADS1118: return k_spi_cfg_ads;
    case SpiClient::BNO085: return k_spi_cfg_imu;
    case SpiClient::ACTUATOR: return k_spi_cfg_act;
    }
    return k_spi_cfg_ads;
}

static void spiBeginCritical(void) {
    if (s_spi_bus_mutex) {
        xSemaphoreTake(s_spi_bus_mutex, portMAX_DELAY);
    }
}

static void spiEndCritical(void) {
    if (s_spi_bus_mutex) {
        xSemaphoreGive(s_spi_bus_mutex);
    }
}

static bool spiTransfer(SpiClient client, const uint8_t* tx, uint8_t* rx, size_t len) {
    const SpiClientConfig& cfg = spiCfg(client);
    if (len == 0) return true;

    const uint32_t t0 = micros();
    spiBeginCritical();

    digitalWrite(CS_STEER_ANG, HIGH);
    digitalWrite(CS_IMU, HIGH);
    digitalWrite(CS_ACT, HIGH);

    sensorSPI.beginTransaction(SPISettings(cfg.freq_hz, MSBFIRST, cfg.mode));
    digitalWrite(cfg.cs_pin, LOW);
    for (size_t i = 0; i < len; i++) {
        const uint8_t v = sensorSPI.transfer(tx ? tx[i] : 0xFF);
        if (rx) rx[i] = v;
    }
    digitalWrite(cfg.cs_pin, HIGH);
    sensorSPI.endTransaction();

    spiEndCritical();
    const uint32_t dt = micros() - t0;
    s_bus_tm.busy_us += dt;
    s_bus_tm.transactions++;
    return true;
}

