Keule/ZAI_GPS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
static void spiCheckDeadline(SpiPollState* poll, uint32_t period_us, uint32_t now_us) {
    if (!poll || period_us == 0) return;
    if (poll->next_due_us == 0) {
        poll->next_due_us = now_us + period_us;
        return;
    }
    if (now_us > poll->next_due_us + period_us) {
        poll->deadline_miss++;
    }
    while (poll->next_due_us <= now_us) {
        poll->next_due_us += period_us;
    }
}

void hal_esp32_imu_spi_check_deadline(uint32_t period_us, uint32_t now_us) {
    spiCheckDeadline(&s_poll_imu, period_us, now_us);
}

bool hal_esp32_imu_raw_transfer(const uint8_t* tx, uint8_t* rx, size_t len) {
    return spiTransfer(SpiClient::BNO085, tx, rx, len);
}

SPIClass& hal_esp32_sensor_spi_port(void) {
    return sensorSPI;
}

void hal_imu_on_sensor_spi_reinit(void);

// ===================================================================
// Mutex (FreeRTOS recursive mutex) — for NavigationState protection
// ===================================================================
#if configSUPPORT_STATIC_ALLOCATION
static StaticSemaphore_t s_mutex_buffer;
static SemaphoreHandle_t s_mutex = nullptr;
#else
static SemaphoreHandle_t s_mutex = nullptr;
#endif

// ===================================================================
// Serial log mutex — protects USB CDC Serial from concurrent access.
// USB CDC (Serial on ESP32-S3) is NOT thread-safe and will crash
// if two tasks call Serial.printf() simultaneously on different cores.
// ===================================================================
static SemaphoreHandle_t s_log_mutex = nullptr;

// ===================================================================
// Timing
// ===================================================================
uint32_t hal_millis(void) {
    return ::millis();
}

uint32_t hal_micros(void) {
    return ::micros();
}

void hal_delay_ms(uint32_t ms) {
    ::delay(ms);
}

// ===================================================================
// Logging – prints to USB CDC Serial via Serial.printf.
//
// ESP_LOGI goes to UART0 by default, which does NOT appear on
// USB CDC Serial on ESP32-S3.  Serial.printf goes to USB CDC.
//
// hal_log() is kept for ABI compatibility with logic/ modules.
// New code should use LOGI/LOGD/LOGW/LOGE from log_ext.h directly.
// ===================================================================
void hal_log(const char* fmt, ...) {
    char buf[256];
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);

    // Protect Serial (USB CDC) from concurrent access across cores.
    if (s_log_mutex) {
        xSemaphoreTake(s_log_mutex, portMAX_DELAY);
    }
    Serial.printf("[%10lu] %s\n", millis(), buf);
    if (s_log_mutex) {
        xSemaphoreGive(s_log_mutex);
    }
}

// ===================================================================
// Mutex
// ===================================================================
void hal_mutex_init(void) {
    // State mutex (recursive, for NavigationState)
#if configSUPPORT_STATIC_ALLOCATION
    s_mutex = xSemaphoreCreateRecursiveMutexStatic(&s_mutex_buffer);
#else
    s_mutex = xSemaphoreCreateRecursiveMutex();
#endif

    // Serial log mutex (binary, protects USB CDC from concurrent access)
    s_log_mutex = xSemaphoreCreateMutex();
}

void hal_mutex_lock(void) {
    if (s_mutex) {
        xSemaphoreTakeRecursive(s_mutex, portMAX_DELAY);
    }
}

void hal_mutex_unlock(void) {
    if (s_mutex) {
        xSemaphoreGiveRecursive(s_mutex);
    }
}

// ===================================================================
// Safety input
// ===================================================================
bool hal_safety_ok(void) {
    // SAFETY_IN is active LOW: LOW = KICK, HIGH = OK
    return digitalRead(SAFETY_IN) == HIGH;
}

// ===================================================================
// SPI Sensors / Actuator - SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_sensor_spi_init(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    if (!s_spi_bus_mutex) {
        s_spi_bus_mutex = xSemaphoreCreateMutex();
    }
    s_bus_tm.window_start_us = micros();
    s_bus_tm.busy_us = 0;
    s_bus_tm.transactions = 0;
    s_poll_imu = {};
    s_poll_was = {};
    hal_log("ESP32: sensor SPI initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
}

void hal_sensor_spi_deinit(void) {
    spiBeginCritical();
    sensorSPI.end();
    spiEndCritical();
    hal_log("ESP32: shared SPI released (FSPI peripheral free)");
}

void hal_sensor_spi_reinit(void) {
    // Ensure the bus is fully released before re-initialising.
    // The OTA code creates a LOCAL SPIClass(FSPI) which can leave
    // the FSPI peripheral in an inconsistent state.  Calling end()
    // again on our sensorSPI forces a clean release, then we re-init
    // with a settling delay.
    spiBeginCritical();
    sensorSPI.end();
    delay(50);   // let SPI peripheral fully settle
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    spiEndCritical();
    delay(10);   // let GPIO matrix reconfigure
    hal_log("ESP32: shared SPI re-initialised on FSPI/SPI2_HOST (SCK=%d MISO=%d MOSI=%d)",
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
    hal_imu_on_sensor_spi_reinit();
}

void hal_sensor_spi_get_telemetry(HalSpiTelemetry* out) {
    if (!out) return;
    std::memset(out, 0, sizeof(*out));
    const uint32_t now_us = micros();
    const uint32_t win_us = (s_bus_tm.window_start_us == 0 || now_us <= s_bus_tm.window_start_us)
                                ? 0
                                : (now_us - s_bus_tm.window_start_us);
    out->window_ms = win_us / 1000;
    out->bus_busy_us = s_bus_tm.busy_us;
    out->bus_transactions = s_bus_tm.transactions;
    out->imu_transactions = s_poll_imu.transactions;
    out->was_transactions = s_poll_was.transactions;
    out->imu_deadline_miss = s_poll_imu.deadline_miss;
    out->was_deadline_miss = s_poll_was.deadline_miss;
    if (win_us > 0) {
        out->bus_utilization_pct = (100.0f * static_cast<float>(s_bus_tm.busy_us)) / static_cast<float>(win_us);
    }
}

void hal_imu_get_spi_info(HalImuSpiInfo* out) {
    if (!out) return;
    out->sck_pin = SENS_SPI_SCK;
    out->miso_pin = SENS_SPI_MISO;
    out->mosi_pin = SENS_SPI_MOSI;
    out->cs_pin = CS_IMU;
    out->int_pin = IMU_INT;
    out->freq_hz = k_spi_cfg_imu.freq_hz;
    out->mode = k_spi_cfg_imu.mode;
}

void hal_imu_set_spi_config(uint32_t freq_hz, uint8_t mode) {
    if (freq_hz == 0) return;
    k_spi_cfg_imu.freq_hz = freq_hz;
    k_spi_cfg_imu.mode = mode;
    hal_log("ESP32: IMU SPI config set (freq=%luHz mode=%u)",
            (unsigned long)k_spi_cfg_imu.freq_hz,
            (unsigned)k_spi_cfg_imu.mode);
}

// ===================================================================
// ADS1118 - 16-Bit ADC for steering angle potentiometer
// ===================================================================
// Uses libdriver/ads1118 (lib/ads1118/src/) for initialisation only.
// For runtime reads, we bypass the libdriver and read raw ADC data
// directly via SPI to avoid the "range is invalid" bug in the
// libdriver's continuous_read() (which reads back the config register
// and fails if SPI returns garbage).
//
// The libdriver is used only for:
//   - ads1118_init() — verify interface functions
//   - ads1118_set_channel/range/rate/mode — configure the chip
//   - ads1118_start_continuous_read() — start continuous conversion
//
// All subsequent reads use ads1118_read_raw() which sends 0xFF×2
// and reads back 2 bytes as a raw int16_t ADC value. No config
// register read-back, no range validation.
//
// Wiring:
//   ADS1118 DOUT  -> GPIO 15 (MISO)
//   ADS1118 DIN   -> GPIO 17 (MOSI)
//   ADS1118 SCLK  -> GPIO 16 (SCK)
//   ADS1118 CS    -> GPIO 18
//
// Calibration:
//   Raw ADC min (left stop)  -> -22.5°
//   Raw ADC max (right stop) -> +22.5°
//   Stored in NVS (Preferences) and survives reboots.
// ===================================================================

/// libdriver ADS1118 handle (used for init/config only)
static ads1118_handle_t s_ads1118_handle;

